src/cf/Documents/EmploymentContract.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>EmploymentContract</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.EmployeeLimitPlaning</xr:Item>
				<xr:Item>InformationRegister._DemoCompaniesEmployees</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Employee</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoIndividuals</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Department</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoDepartments</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EndContractDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Entity</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoCompanies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Period</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmployeeCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>LimitsForEmployees</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>TypeOfLimit</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.TypesOfLimitsForEmployees</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LimitDate</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LimitDateEnd</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Stage</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.StageOfLimitsForEmployees</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>StageDescription</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Limit</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Count</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>NotApplicable</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/_DemoCompaniesEmployees.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>_DemoCompaniesEmployees</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Department_Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoDepartments</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>OccupiedRates</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>EmployeeCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Organization</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoCompanies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Individual</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoIndividuals</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/EmploymentContract/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// EVENT HANDLERS

#Region EventHandlers

Procedure FillCheckProcessing(Cancel, CheckedAttributes)

	RunControl(Cancel);

EndProcedure // FillCheckProcessing() 

Procedure Filling(FillingData, StandardProcessing)

	If FillingData = Undefined Then // Create a new item.
		_DemoStandardSubsystems.OnEnterNewItemFillCompany(ThisObject, "Entity");
	EndIf;

EndProcedure

Procedure BeforeWrite(Cancel, WriteMode, PostingMode)

	LimitsForEmployeesServer.BeforeWrite(ThisObject, Cancel, WriteMode, PostingMode);

EndProcedure

Procedure Posting(Cancel, PostingMode)
	
	// Initialization of additional properties for document posting.
	DocumentPosting.InitializeAdditionalPropertiesForPosting(Ref, AdditionalProperties);
		
	// Initialization of document data.
	Documents.EmploymentContract.DataInitializationDocument(Ref, AdditionalProperties);
	
	// Prepare recordsets.
	DocumentPosting.PrepareRecordSetsForRecording(ThisObject);
	
	TableForRegisterRecords = AdditionalProperties.TableForRegisterRecords; 
	
	// Reflect in accounting sections.  
	DocumentPosting.ReflectRegisterRecords("_DemoCompaniesEmployees", TableForRegisterRecords, RegisterRecords, Cancel);
	DocumentPosting.ReflectRegisterRecords("EmployeeLimitPlaning", AdditionalProperties.TableForRegisterRecords, RegisterRecords, Cancel);

	// Write recordsets.
	DocumentPosting.WriteRecordSets(ThisObject);

	AdditionalProperties.ForPosting.StructureTemporaryTables.TempTablesManager.Close();

EndProcedure // Posting()

Procedure OnWrite(Cancel)

	LimitsForEmployeesServer.OnWrite(ThisObject, Cancel);

EndProcedure

Procedure OnSetNewNumber(StandardProcessing, Prefix)
	
	Prefix = "A";
	
EndProcedure

#EndRegion // EventHandlers

// Performs control of contradictions.
Procedure RunControl(Cancel)

	If Cancel Then
		Return;	
	EndIf;

	EmployeesFromDoc = New ValueTable; 

	EmployeesFromDoc.Columns.Add("Employee",	New TypeDescription("CatalogRef._DemoIndividuals")); 
	EmployeesFromDoc.Columns.Add("Period",		New TypeDescription("Date")); 

	Row = EmployeesFromDoc.Add();
	Row.Employee	= Employee;
	Row.Period		= Period;

	Query = New Query;   

	Query.SetParameter("Ref",				Ref);
	Query.SetParameter("Entity",			Entity);
	Query.SetParameter("EmployeesFromDoc",	EmployeesFromDoc);

	Query.Text = RunControlQueryText();

	ResultsArray = Query.ExecuteBatch();
	
	// Employee is already hired on hiring date.
	If Not ResultsArray[2].IsEmpty() Then

		QueryResultSelection = ResultsArray[2].Select();

		While QueryResultSelection.Next() Do

			MessageText = NStr(
				"en = 'Employee %1 is already working in the company.';
				|ru = 'Cотрудник %1 уже работает в компании.'");

			MessageText = StrTemplate(MessageText, QueryResultSelection.EmployeePresentation);

			Common.MessageToUser(MessageText, ThisObject, "Employee",, Cancel);
		EndDo;
	EndIf;

EndProcedure   

Function RunControlQueryText()
	
	QueryText =
	"SELECT
	|	CAST(EmployeesFromDoc.Employee AS Catalog._DemoIndividuals) AS Employee,
	|	EmployeesFromDoc.Period AS Period
	|INTO EmployeesFromDoc
	|FROM
	|	&EmployeesFromDoc AS EmployeesFromDoc
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	EmployeesFromDoc.Employee AS Employee,
	|	MAX(Employees.Period) AS Period
	|INTO EmployeeIsWorked
	|FROM
	|	InformationRegister._DemoCompaniesEmployees AS Employees
	|		INNER JOIN EmployeesFromDoc AS EmployeesFromDoc
	|		ON Employees.Individual = EmployeesFromDoc.Employee
	|			AND (Employees.Organization = &Entity)
	|			AND Employees.Period <= EmployeesFromDoc.Period
	|			AND (Employees.Recorder <> &Ref)
	|
	|GROUP BY
	|	EmployeesFromDoc.Employee
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	EmployeeIsWorked.Employee AS Employee,
	|	PRESENTATION(EmployeeIsWorked.Employee) AS EmployeePresentation
	|FROM
	|	EmployeeIsWorked AS EmployeeIsWorked
	|		INNER JOIN InformationRegister._DemoCompaniesEmployees AS Employees
	|		ON EmployeeIsWorked.Employee = Employees.Individual
	|			AND EmployeeIsWorked.Period = Employees.Period
	|			AND (Employees.Organization = &Entity)";

	Return QueryText;

EndFunction
